
// <<< Начало: А.С. Голубев -> 15.09.2024г.
// Задача: Вывести отображение контактного лица вместе с его основаниями полномочий
 #Область ОбработчикиСобытий
 Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
 	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Основание");
 КонецПроцедуры
 
 Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
 	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.Основание) Тогда
		Представление = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.Основание);
	Иначе
		Представление = Данные.Наименование;  
	КонецЕсли;
 КонецПроцедуры
 #КонецОбласти
 // Конец: А.С. Голубев >>>